Core/src/src/Documents/Конвертация/Конвертация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Конвертация</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>InformationRegister.ОтчетПоКурсовымРазницам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПодотчетниками</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийКонвертация</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОтправитель</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПолучатель</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсОтправитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсПолучатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьОтправитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьПолучатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКонвертации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПолучено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Подотчетник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйКлючВИнтернетБанке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КроссКурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоммерческийКурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыданныеАвансы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходСоСчета</types>
        <types>DocumentRef.РасходИзКассы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/Documents/Конвертация/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.Конвертация.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДенежныеСредства(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПодотчетниками(ДополнительныеСвойства, Движения, Отказ);
	ОтразитьОтчетКурсовыхРазниц(ДополнительныеСвойства, Движения, Отказ);
	
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения, "");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.ВидыОперацийКонвертация.Подотчетник Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Отправитель");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Получатель");
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийКонвертация.СоСчета Тогда
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьЗагрузкуИзБанка") 
			И Отправитель.Банк.ИспользуетсяДляИнтеграцииСБанком Тогда  
			
			ПроверяемыеРеквизиты.Добавить("Комментарий");
			
		КонецЕсли;
	КонецЕсли;
	
	СуммаАванс =  ВыданныеАвансы.Итог("Сумма");  //++Lazare
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКонвертация.Подотчетник")  Тогда 
		Если СуммаАванс <> СуммаКонвертации Тогда
			
			ТекстСообщения =			    
			НСтр("ru = 'Сумма конвертации: %СуммаКонвертации% %ВалютаОтправитель%, не соответствует сумме разнесенных платежей в табличной части: %СуммаАванс% %ВалютаОтправитель%!'; ka = 'დოკუმენტის თანხა: %СуммаКонвертации% %ВалютаОтправитель%, არ შეესაბამება განკუთვნებულ გადახდებს ცხრილში: %СуммаАванс% %ВалютаОтправитель%!'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаКонвертации%", Строка(СуммаКонвертации));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаАванс%", Строка(СуммаАванс));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВалютаОтправитель%", СокрЛП(Строка(ВалютаОтправитель)));
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			ЭтотОбъект,
			ТекстСообщения,
			,
			,
			"СуммаКонвертации",
			Отказ
			);
			
		КонецЕсли;
	КонецЕсли;

	

	
КонецПроцедуры

Процедура ОтразитьОтчетКурсовыхРазниц(ДополнительныеСвойства, Движения, Отказ)

	ТаблицаОтчетКурсовыхРазниц = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОтчетКурсовыхРазниц;
	
	Если Отказ
	 ИЛИ ТаблицаОтчетКурсовыхРазниц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Создадим набор записей регистра сведений ОтчетПоКурсовымРазницам.
	НаборЗаписейОтчетПоКурсовымРазницам = РегистрыСведений.ОтчетПоКурсовымРазницам.СоздатьНаборЗаписей();
	НаборЗаписейОтчетПоКурсовымРазницам.Отбор.Регистратор.Установить(Ссылка);	
	
	Для Каждого Строк Из ТаблицаОтчетКурсовыхРазниц Цикл 
		
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строк);	
		НоваяСтрока.Период = Дата;
		
	КонецЦикла;
	
	НаборЗаписейОтчетПоКурсовымРазницам.Записать(Истина);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	УникальныйКлючВИнтернетБанке = "";
КонецПроцедуры
